
local sh_desc_ch = {
	shanhai_kunlunisland = [[
【背景】
创建世界时在海洋上生成，带有“烛龙法阵”、“鲲鹏”以及部分山河生态。

【特殊】
将“迷榖枝”放到地上，右键引路可以指向“昆仑龙脉岛屿”的位置。
	]],
	shanhai_deepseacave = [[
【背景】
“洞天塔”的塔内世界，位于世界之外。只可在创建世界时生成，旧档添加不会生成。

【特殊】
“洞天塔”内不会有猎犬来袭、不会生成史诗级BOSS。
“洞天塔”内防雨（包括玻璃雨）、防雪，不会增加潮湿度。

”洞天塔“一层分为主岛和附岛，附岛带有“小玻璃绿洲”。“小玻璃绿洲”范围带有启蒙效果。
“洞天塔”一层附岛默认不对玩家开放。无论玩家通过任何手段登陆附岛，都会被强制传送回主岛。给予“羽润”1个“彩色羽毛”后，玩家才可正常登陆一层附岛，且不再被排斥。

建造“朱源的小铺”后，学习制作“伪装灵芝”蓝图，可进入“洞天塔”二层，激活“洞天塔”二层“突兀的石头”回到一层。

“洞天塔”被封印后，一层出口将被关闭。此时玩家仍然可以通过一层“突兀的石头”离开“洞天塔岛屿”，“突兀的石头”藏在“小石潭”附近。
	]],
	shanhai_deepseacave_two = [[
【背景】
“洞天塔”的塔内世界，位于世界之外。只可在创建世界时生成，旧档添加不会生成。

【特殊】
“洞天塔”内不会有猎犬来袭、不会生成史诗级BOSS。
“洞天塔”内防雨（包括玻璃雨）、防雪，且不会增加潮湿度。

建造“朱源的小铺”后，学习制作“伪装灵芝”蓝图，可进入“洞天塔”二层，跳入洞天塔裂口回到一层。
	]],
	sh_zhuyan_spawner = [[
【背景】
《山海经·西山经》：又西四百里，曰小次之山，其上多白玉，其下多赤铜。有兽焉，其状如猿而白首赤足，名曰朱厌，见则大兵。

【特殊】
使用稿子敲击3次后，小次山会颤抖，‘朱厌’破山而出。
在小次山附近杀死1只猴子，同样会使‘朱厌’破山而出。

开启‘山海秘藏’后，击杀附近的‘小朱厌’，同样会使‘朱厌’破山而出。

击杀‘朱厌’后，‘小次山’进入冷却状态，冷却CD为20天。
	]],
	shanhai_secretplace = [[
【背景】
“昆仑龙脉岛屿”的法阵，带有6个激活音符：宫、商、角、徵、羽、=，分别对应古乐调的C、D、E、G、A，=为提交按键。

【特殊】
玩家解密“线索纸”后，根据答案激活音符，可以触发音效，按指定顺序输入后可以获取道具、彩蛋。

音符需要手动激活，不是用来踩的！
	]],
	shanhai_secretorder = [[
【背景】
“昆仑龙脉岛屿”的“烛龙法阵”激活装置。6个激活音符：宫、商、角、徵、羽、=，分别对应古乐调的C、D、E、G、A，=为提交按键。

【特殊】
玩家解密“线索纸”后，根据答案激活音符，可以触发音效，按指定顺序输入后可以获取道具、彩蛋。

音符需要手动激活，不是用来踩的！
	]],
	deepseacave_pool = [[
【背景】
“洞天塔”的“小石潭”，默认长有“扭曲的大树”。可作为水源，与“扭曲的大树”的交互依托于“小石潭”。

【特殊】
制作“晶洞果种藤”、“夜莓种藤”、“高脚鸟蛋种藤”投入“小石潭”后，可以寄生对应的藤蔓。
捕捉“发光蟹”放生到“小石潭”后，“发光蟹”会在“扭曲的大树”上安家，并且给予小范围的光源buff。
	]],
	deepseacave_exit = [[
【背景】
“洞天塔”一层的出口，冬季到来时，出口的苔藓和枝叶会枯落。玩家可通过“洞天塔出口”离开“洞天塔岛屿”，返回“洞天塔”位置。

【特殊】
“洞天塔”被封印后，出口将被关闭。此时玩家仍然可以通过“突兀的石头”离开“洞天塔岛屿”，“突兀的石头”藏在“小石潭”附近。
	]],
	sh_tictactoe_game = [[
【背景】
“洞天塔”小游戏，给予“异域长老”任意金子、山海烧仙草、句芒印记后参与游戏。

5秒内没有玩家B参与时，“异域长老”会加入游戏，此时玩家给予的道具会决定游戏难度，金块（困难）、山河烧仙草（中等）、句芒印记（简单）

【特殊】
玩家A和玩家B分别获得X和O棋子，随机先后手。

游戏时长最多1分钟，1分钟未分胜负则强制结束游戏。
获胜者将获得奖励，平局或者失败没有奖励，奖励直接发送到玩家背包。

奖池概率：金块>海蚀柱蓝图>小石潭蓝图=小石阶蓝图>猪鼻铸币=空的长生不老药
 
重新加载游戏后，棋盘与棋子均会消失
	]],
	shanhai_hiddenexit = [[
【特殊】
按下一层的石头后，会在“小石潭”附近生成一枝“花藤”，连续按下三次后，生成一道“时空裂隙”，玩家跳入后可传送到“绚丽之门”。
	]],
	dsc_light = [[
【背景】
“羽润”施放的火焰法术。

【特殊】
火焰动画来自MOD——“拼好mod”。
	]],
	xuanhe_fall = [[
【背景】
“悬河秘境”的瀑布，功能没有完全放出，目前仅作为水源、瀑布造景。
	]],
	xuanhe_pond = [[
【背景】
“悬河秘境”的池塘，修缮后可作为水源。

【特殊】
初始为干涸状态，需要解密检查文本，给予对应物品后才能进入下一阶段。

【阶段1谜题】萤火芳菲皆可容
【阶段2谜题】天地灵韵聚凝华
【阶段3谜题】金黄满树如蝶翩
【阶段4谜题】不见风霜刻骨痕

游戏加载界面概率出现解密答案，给予猪哥“线索纸”概率获取答案。

玩家解密修复“悬河池塘”后，池塘会生成“发光蟹”。
玩家可在悬河池塘钓到海鱼，钓到当季时令鱼的概率最大。
	]],
	sh_seastack = [[
【背景】
官方原版的海蚀柱，现在可制作。

【特殊】
与“异域长老”进行游戏获胜后，概率获取蓝图。
可以直接使用扫把更换造型。
	]],
	sh_marsh_plant = [[
【背景】
官方原版池塘边的植物，现在可制作。

【特殊】
与“异域长老”进行游戏获胜后，概率获取蓝图。
	]],
	sh_pond_algae = [[
【背景】
官方原版池塘边的植物，现在可制作。

【特殊】
与“异域长老”进行游戏获胜后，概率获取蓝图。
	]],
	sh_fly = [[
【背景】
西方魔法，东方法术，鸦都会一点！在月圆之夜，给予“羽润”1个“南瓜”换取蓝图制作“山参扫把”。
装备“山参扫把”后，右键玩家飞行，取下装备后落地。

【特殊】
来自steam创意工坊作品“飞天扫帚”。
该道具属于小彩蛋，不是山河的内容，所以不会进行更多功能拓展。
	]],
	sh_cookpotfire = [[
【背景】
额外的灶火机制，玩家使用烹饪锅、远古窑制作料理时，会在锅的底部产生火焰。
烹饪冰激凌、芦笋汤等降温料理会产生冷火。

大厨锅属于概念级别的烹饪工具，不会产生灶火。
	]],
	sh_boat = [[
【背景】
额外的航海机制，玩家将“小叶槎”放置在海洋会变为小船。
自带1格船灯位置，玩家在非航行状态下右键可以将小船收回。

小船没有使用耐久，船体受到的伤害均由玩家承担。
可以携带重物登船，但会导致玩家减速。
	]],

	deepseacave_pigman = [[
【背景】
洞天塔的原住民。

【特殊】
在“朱源的小屋”附近建造一口锅，锅内制作料理炖肉汤，不要取走。制作并打开“小风扇”，肉香味会吸引朱源出门。
事件只需要触发一次，朱源就能自行永久出门探索。

给予“朱源”1个“芝上谈冰”，可以换取“朱源的小铺”蓝图。

【行为】
开店（玩家靠近小铺时）；
捡吃的（包括锅里的食物）；
开冰箱偷东西吃，玩家靠近冰箱可以打断偷吃；
开冰箱放食材，食材种类和新鲜度随机；
自己烹饪食物（随机使用食材）；
在正烹饪食物的锅旁边闲逛；
装死，玩家可以给食物及时救起朱源；
2次装死被救起时，朱源会施法催生一株巨大作物；
与羽润打架；
	]],
	deepseacave_crow = [[
【背景】
洞天塔的原住民，会法术的小乌鸦。

【特殊】
对玩家的默认好感度为1，在“小石潭”附近建造“火坑”、“百鸟朝凤雕塑”可以提升其好感度，好感度最高为3。
“羽润”可以接受玩家赠礼并进行回礼，好感度越高，回礼价值越高。
给予下列物品后，“羽润”概率回礼：
+ 各色宝石、羽毛、山海烧仙草
给予下列物品后，“羽润”必定回礼：
+ 龙鳞、熊皮、巨鹿眼球、犀牛角

玩家可以使用“迷榖枝”恶搞羽润，首次恶搞获得沾光buff，为“迷榖枝”增加小范围光照效果，玩家多次恶搞“羽润”会被嘴臭。
给予“羽润”1个“彩色羽毛”后，开放洞天塔大的附属岛屿，玩家可登正常陆塔内附岛，不会被排斥。
“羽润”会与主动靠近的玩家打招呼，与“樱桃子”有特殊文本交互，可接受“樱桃”和“烤樱桃”交易，直接获取“合璧蓝图雕塑”的蓝图。

在月圆之夜，给予“羽润”1个“南瓜”换取“山参扫把”蓝图。西方魔法，东方法术，鸦都会一点！

【行为】
收到贵重礼物后，会随机进入一种鉴赏状态，然后收走礼物并回礼；
会在“小石潭”附近闲逛自言自语；
会主动敲门骚扰朱源；
嘴馋玩家锅里烹饪的食物（但不会偷吃）；
傍晚时主动为玩家添加篝火的燃料;
会蹲坐在篝火附近烤火；
在“百鸟朝凤雕塑”附近练习法术；
警惕危险生物，能够看到影怪，并警惕逃跑。
	]],
	dsc_elderswampig = [[
【背景】
“洞天塔二层”的长老，给予任意金子、山海烧仙草、句芒印记后开启井字棋小游戏。

5秒内没有玩家B参与时，“异域长老”会加入游戏，此时玩家给予的道具会决定游戏难度，金块（困难）、山河烧仙草（中等）、句芒印记（简单）

【特殊】
玩家A和玩家B分别获得X和O棋子，随机先后手。

游戏时长最多1分钟，1分钟未分胜负则强制结束游戏。
获胜者将获得奖励，平局或者失败没有奖励，奖励直接发送到玩家背包。

奖池概率：金块>海蚀柱蓝图=小石潭蓝图=小石阶蓝图=植物蓝图=水藻蓝图>猪鼻铸币=空的长生不老药
 
重新加载游戏后，棋盘与棋子均会消失。
	]],
	shanhai_zhuyan = [[
【背景】
《山海经·西山经》：有兽焉，其壮如猿而白首赤足，名曰朱厌，见则大兵。
在绿洲附近的小次山出没，使用稿子敲击3次小次山后出现。

【战斗】
30000血量，75攻击力。
初始为防御状态，受到的伤害减半。玩家食用“伏特羊角冻”进行攻击或是催眠“朱厌”后可使其破防。
非防御状态下，每过13s或受到2000伤害后，“朱厌”恢复防御状态。

【朱厌技能】
勾拳、飞扑，召唤（猴群、狗群、蝙蝠、鬼魂、蜘蛛、电羊、树精），锤击铃铛（降低范围内玩家的san值）。

【战斗-阶段1】
锁定防御状态，使用勾拳攻击。
【战斗-阶段2】
90%血量后，使用勾拳2连击，并解锁召唤技能
【战斗-阶段3】
80%血量后，重新进入防御状态。
【战斗-阶段4】
50%血量后，使用勾拳4连击，并解锁铃铛魔音
【战斗-阶段5】
25%血量后，使用勾拳999连击。

【特殊】
“朱厌”死亡掉落“大肉”、“悬河灵玉”、“朱厌角”、“朱厌铃铛”、“空的长生不老药”。
	]],
	kun_rider = [[
【背景】
被困在“昆仑龙脉岛屿”的古老生物。

【特殊】
给予1个“句芒叶”可以获取“句芒印记”蓝图。
给予1个“句芒印记”有3%概率获取1个“坎普斯背包”。
给予1个“出逃腿靴”可以帮助“鲲鹏”逃脱岛屿束缚，获取“小叶槎”。
	]],
	sh_qinyuan = [[
【背景】
《山海经·西次三经》：昆仑山，有鸟焉，其状如蜂，大如鸳鸯，名曰钦原，蠚鸟兽则死，蠚木则枯。

玩家使用“辉煌尾刺”右键进行召唤，并可以激怒、平息、召回。
“钦原”死亡后，尾刺也会消失。

【战斗】
默认难度配置下，3000血量，攻击有30%概率转为1格范围的火焰法术。低于1000血量时有30%概率使用法术恢复自身500血量。

【特殊】
“钦原”完全免疫亮茄伤害，不会攻击玩家，主动仇恨附近怪物。
旧档存在的无主“钦原”可以通过“红绳”进行回收。
	]],
	sh_paperbird = [[
【背景】
“朱源”使用法术制作的“纸燕”，身上写有猪人部落的文字，只会在桦树林区域降落。

【特殊】
杀死“纸燕”后掉落“线索纸”。可用“捕鸟陷阱”捕捉，养在鸟笼中，鸟笼中的“纸燕”不会死亡。
鸟笼中的“纸燕”1个“羽毛笔”进行逼供可以掉落“线索纸”，给予肉、作物也可以正常掉落鸟蛋、种子。

开启“永不妥协”MOD之后，可能会导致“羽毛笔”无法给予鸟笼中的“纸燕”，玩家可以合理进行理赔。
	]],
	deepseacave_fish = [[
【背景】
“洞天塔岛屿”中的锦鲤，在塔内的海洋区域不定期出现，无法交互。

【特殊】
贴图和动画的视觉效果很差，默认不放出。
想要看可以在配置界面设置“洞天锦鲤”查看。
	]],
	sh_fishspawner = [[
【背景】
“洞天塔”的小鱼群，在“洞天塔”岸边的海洋区域出现。玩家靠近时小鱼群会被吓跑，无法交互。

【特殊】
小鱼群不会阻挡玩家铺设码头。
	]],
	shanhai_phoenix = [[
【背景】
《山海经·南山经》：有鸟焉，其状如鸡，五采而文，名曰凤凰，首文曰德，翼文曰义，背文曰礼，膺文曰仁，腹文曰信。是鸟也，饮食自然，自歌自舞，见则天下安宁。

【特殊】
玩家建造“百鸟朝凤雕塑”，使用各色羽毛（红、黄、蓝、白、灰、黑）进行装饰后，会在附近召唤“凤凰虚影”。虚影会朝随机方向飞行，飞行途中掉落“彩色羽毛”、“浴火重生蓝图”。

“凤凰虚影”不会在夜晚出现。由于“洞天塔”设定的特殊性，塔内只会有百鸟朝凤的彩蛋，不会生成“凤凰虚影”。
	]],
	sh_migutree = [[
【背景】
《山海经》：迷穀，木也，生於西海招搖山之上，其狀若構樹，有黑理焉，光華四照，人佩之而不迷。
世界生成时，在蜂后区域附近生成的植株。

【特殊】
默认情况下，每10天长成1次，长成后采集获取“迷榖枝”。在黄昏和夜晚会发光。
在朱源的小铺进行交易获取蓝图，使用“迷榖枝”和“句芒印记”制作进行移植。
	]],
	dsc_oceantree_pillar = [[
【背景】
生长在“小石潭”中的“扭曲的大树”，由“羽润”使用法术催生而成，顶部从塔顶破洞长出，以堵住塔顶缺口。

【特殊】
二层“扭曲的大树”暂时无法交互！！！

初始带有3到4根藤蔓，藤蔓的类型根据MOD难易程度而定。

玩家与“扭曲的大树”的交互依托于“小石潭”。
制作“晶洞果种藤”、“夜莓种藤”、“高脚鸟蛋种藤”投入“小石潭”后，可以寄生对应的藤蔓。
捕捉“发光蟹”放生到“小石潭”后，“发光蟹”会在“扭曲的大树”上安家，并且给予小范围的光源buff。
	]],
	shanhai_goumang_plant = [[
【背景】
《山海经·海外东经》：东方勾芒，鸟身人面，乘两龙。传说中的春神、木神、东方之神、东海之神、木星之神，掌管草木的生长。
主要生成在“昆仑龙脉岛屿”上，“洞天塔”内有概率生成。

【特殊】
不会被“亮茄”寄生，夏天会枯萎。采集时获取“句芒叶”，有概率获取“句芒印记”。
可移植，移植后的“句芒植株”必须使用“息壤”进行施肥才能生长。

如果“句芒植株”附近没有“萤火虫”，它会在周围生成一只，生成周期为3天。
	]],
	shanhai_shanshen_planted = [[
【背景】
分布在“昆仑龙脉岛屿”上，“洞天塔”内有概率生成，“蜂后区域”也会有一株。

【特殊】
玩家空手采集后生成“山参精”，“山参精”会主动逃离玩家。使用“红绳”束缚后，玩家采集可以获取“山参”。
	]],
	shanhai_xirang = [[
【背景】
《山海经·海内经》：洪水滔天，鲧窃帝之息壤以堙洪水，不侍帝命，帝令祝融杀鲧于羽郊。鲧腹生禹，帝乃命禹率布土以定九州。

【特殊】
玩家采集“息壤”后会破坏周围码头，并出现3到5个鬼魂攻击采集者。
	]],
	shanhai_ginkgo_tree = [[
【背景】
春时新叶微红，秋深老叶金黄，皆成画境。

【特殊】
4个生长阶段：小-中-大（绿色）-大（金色），可被点燃、冬天会有落雪
只有砍伐金色银杏树才会掉落银杏、银杏叶、杏叶蝶。
	]],
	shanhai_ganoderma = [[
【背景】
差一点点就成精的蘑菇精怪。

【特殊】
玩家靠近会缩地，然后弹起击飞玩家，移植到“洞天塔”中的“灵芝”不会攻击玩家。
灵芝在被采集后，需要累计经历2天的雨水才会重新长出。
灵芝在被任意方式摧毁30天后，会在附近尝试再生一株灵芝。
	]],
	shanhai_mushroomguard2 = [[
【背景】
用“鹿角”栽种生成“鹿茸”，可重新挖掘获取“鹿角”。

【特殊】
种植3个？形状的“鹿茸”会转为生成一株“灵芝”。
	]],
	sh_flower = [[
【背景】
扈江离与辟芷兮，纫秋兰以为佩。制芰荷以为衣兮，集芙蓉以为裳。

字谜：萤火芳菲皆可容。
	]],
	shanhai_orangefly = [[
【背景】
外表看起来像是银杏叶的蝴蝶，砍伐银杏树后出现，可栽种生成山花。
	]],
	shanhai_flowervine = [[
【背景】装饰用的藤蔓。
	]],
	shanhaivine_moon = [[
【背景】
“扭曲的大树”的藤蔓，采集获取月树花。
	]],
	shanhaivine_gem = [[
【背景】
将“晶洞果种藤”投入“小石潭”，或者直接寄生到“水中木”上之后，生成“晶洞果藤”。

【特殊】
可使用剃刀割断藤蔓。
多次寄生动作不会生成更多藤蔓，而是升级原有藤蔓。
	]],
	shanhaivine_night = [[
【背景】
将“夜莓种藤”投入“小石潭”，或者直接寄生到“水中木”上之后，生成“夜莓果藤”。

【特殊】
可使用剃刀割断藤蔓。
多次寄生动作不会生成更多藤蔓，而是升级原有藤蔓。
	]],
	dsc_eggvine = [[
【背景】
将“高脚鸟蛋种藤”投入“小石潭”，或者直接寄生到“水中木”上之后，生成“高脚鸟蛋藤”。

【特殊】
可使用剃刀割断藤蔓。
多次寄生动作不会生成更多藤蔓，而是升级原有藤蔓。
	]],

	statue_chaofeng = [[
【背景】
《山海经·南山经》：有鸟焉，其状如鸡，五采而文，名曰凤凰，首文曰德，翼文曰义，背文曰礼，膺文曰仁，腹文曰信。是鸟也，饮食自然，自歌自舞，见则天下安宁。
在朱源的小铺交易蓝图。雕塑附近小范围内恢复玩家san值。

【特殊】
按照设定，百鸟朝凤事件无法在塔内触发！

玩家初始建造的雕塑为失色状态，使用红（罗宾）、黄（金丝雀）、白（冬季罗宾）、蓝（邪天翁）、灰（麋鹿鹅）、黑（乌鸦）羽毛进行装饰，可召唤“凤凰虚影”。“凤凰虚影”不会在夜晚生成，追踪虚影可以捡取“彩色羽毛”、“浴火重生雕塑蓝图”。
全部羽毛装饰完成后，在雕塑附近不定期性触发百鸟朝凤彩蛋，触发时降落10~20只随机鸟类。

在“小石潭”附近建造可以提升“羽润”好感度，“羽润”会在雕塑附近练习火焰法术。

雕塑可以被“栅栏击剑”转向。
	]],
	statue_zhulong = [[
【背景】
《山海经·大荒北经》：西北海之外，赤水之北，有章尾山。有神，人面蛇身而赤，直目正乘，其瞑乃晦，其视乃明，不食不寝不息，风雨是谒。是烛九阴，是烛龙。
在朱源的小铺进行交易掉落蓝图。建造的“烛龙晦朔雕塑”世界唯一，且只能在地上建造。

【特殊】
“昆仑龙脉岛屿”上“烛龙法阵”的“烛龙晦朔雕塑”为失色状态，会对解密失败的玩家给予一定提示或是嘲讽。玩家通过蓝图建造的雕塑拥有完整颜色。

由玩家建造的“烛龙晦朔雕塑”会根据世界时间变换，眼睛睁开世界进入天亮，眼睛闭合世界进入黑夜。在烛龙爪上放置指定物品，献祭后控制白天、黄昏、黑夜状态。
当前世界的时间状态可在小窗口中查看，只需要放大亿点点...

'句芒印记'   ——昼夜分明 【默认】
'黄色月眼'   ——只有白天
'橙色月眼'   ——只有黄昏
'紫色月眼'   ——只有黑夜
'芝上谈冰'   ——极长黄昏
'参鸡妙蒜'   ——极长黑夜 【料理未实现，可使用蓝色月眼代替】
'山海烧仙草'  ——极长白天
'曼德拉草汤'  ——没有白天
'舒缓茶'     ——没有黄昏
'辣椒炖肉'   ——没有黑夜
	]],
	statue_niepan = [[
【背景】
拥有凤凰神力的雕塑。追踪“凤凰虚影”得到该蓝图。雕塑为热源，鬼魂状态下的玩家可作祟“浴火重生雕塑”进行复活。

【特殊】
放入“浴火重生雕塑”的物品会停止腐烂。
放置部分生物的掉落物，点燃后复活对应生物，可用于复活生物。

浴火重生雕塑可接受的物品：
+ 麋鹿鹅毛、龙鳞、熊皮、眼球
+ 坎普斯背包（坎普斯）、麋鹿茸（克劳斯）
+ 启迪碎片（天体英雄）、暗影香炉（远古织影者）
+ 犀牛角、邪天翁羽毛、蜂王冠、蜘蛛帽
+ 出逃腿靴、乳白物、蟾蜍皮
+ 犬牙、犬牙背心（座狼）、发光浆果（洞穴蠕虫）
+ 各色羽毛、猫尾、牛角、羊角、蝴蝶翅膀
+ 活木、猪皮、兔毛、鱼（鱼人）、象鼻、鹿角
+ 格罗姆花、啜食者皮、一角鲸的角
+ 齿轮（发条骑士）、触手皮、海象牙
+ 火龙果（蝾螈）、友好果蝇果
+ 背壳头盔（蛞蝓龟）、蜗壳护甲（蜗牛龟）
+ 鸟腿（火鸡）、月亮蘑菇（蘑菇地精）、蚊子血囊（蚊子）
+ 裸露鼻孔（裸鼹蝠）、蛙腿、钢丝棉、冰冻的岩浆虫
+ 高脚鸟蛋、死龙虾、鼹鼠帽
+ 线索纸、朱厌角、句芒印记（句芒植株）、灵芝、山参
	]],
	statue_eatmoon = [[
【背景】
《山海经·西山经》：（阴山）浊浴之水出焉，而南流于番泽。其中多文贝，有兽焉，曰天狗，其状如狸而白首，其音如榴榴，可以御凶。
在朱源的小铺进行交易掉落蓝图。

【特殊】
给予“蓝宝石”后，天狗会睁开眼睛。

在月圆的当天，睁开眼睛的天狗会消失，当晚触发“天狗食月”彩蛋。已经给予了天体宝球的雕塑不会开启食月事件。

食月事件完成后，当晚月相变为新月，雕塑变为范围3的光源。
雕塑将拥有1个储物空间，但只可以放天体宝球。给予天体宝球可以扩大光源范围到7，升级后的天体宝球扩大光源范围到13。
给予天体宝球后，玩家可以靠近雕塑解锁天体宝球科技。

使用“月坠”施法可以打断食月事件，此时天体能量战胜并附身天狗，在雕塑附近会掉落“附身座狼”。
	]],
	sh_cherrystatue = [[
【背景】
“樱花林”相关的雕塑。

【特殊】
在朱源的小铺进行交易掉落蓝图。
纪念小怪物之间的友谊，感谢樱花林作者ADM的帮助。
	]],
	sh_seasonaquarium = [[
【背景】
拥有烛龙神力的建筑，靠近炼金引擎制作。

【特殊】
给予时令鱼，可以缓解附近的作物的季节压力。
花朵金枪鱼【春】、炽热太阳鱼【夏】
落叶比目鱼【秋】、  冰雕鱼 【冬】
给予活鳗鱼，可以当作避雷针使用。

举例：辣椒喜爱秋夏，在鱼囿中放置太阳鱼，能缓解冬季种植辣椒的季节压力。

兼容MOD作物：
+ 神话书说的葫芦
+ 棱镜的松萝
+ 勋章的包果、不朽果实
+ 海洋传说的芒果、葡萄
+ 荔只只物语的荔枝
+ 丰耘秘境的作物
	]],
	deepseacave_pighouse = [[
【背景】
“洞天塔”的原住民。

【特殊】
玩家或者“羽润”可以敲朱源的小屋门，敲门后“朱源”会探头进行恐吓。
将“猪鼻铸币”塞进“朱源的小屋”可以获取道具“云开”。

在“朱源的小屋”附近建造一口锅，锅内制作料理炖肉汤，不要取走。制作并打开“小风扇”，肉香味会吸引朱源出门。
事件只需要触发一次，朱源就能自行永久出门探索。
	]],
	dsc_pig_shop = [[
【背景】
与朱源进行交易的商铺，给予“朱源”1个“芝上谈冰”后解锁。
	]],
	shanhai_shellchest = [[
【背景】
贝壳做的箱子，3*4的内部空间，100%防火。
	]],
	shanhai_hiddencellar_use = [[
【背景】
石头做的箱子，3*4的内部空间，100%防火。
	]],
	sh_rock_1 = [[
【背景】观赏用的石景。
	]],
	sh_basefan = [[
【背景】来自哈姆雷特的小风扇。

【特殊】
在“朱源的小屋”附近建造一口锅，锅内制作料理炖肉汤，不要取走。制作并打开“小风扇”，肉香味会吸引朱源出门。
事件只需要触发一次，朱源就能自行永久出门探索。
	]],
	sh_ironopenwork_base = [[
【背景】
过年期间的气氛小物件。

【特殊】
激活后发射小烟花粒子，持续18秒，期间会进行3次判定，每次都有0.5%的概率判定成功，喷发3~5个奖励。
冬季盛宴期间，判定概率增长到1%。
使用5次后，道具消失。
奖励概率：金块>红宝石=蓝宝石=猪鼻铸币>橙宝石=黄宝石>绿宝石=紫宝石=空的长生不老药。
	]],
	sh_seanest = [[
【背景】
威吊想在海边做1个贻贝杆，但是这片海域只有藤壶和海鸥！
靠近炼金引擎制作，只可建造在海边。

【特殊】
玩家建造后，“海鸟巢”顶部会随机落下“海鸥”或“海鹦鹉”。周期性生成“藤壶”，玩家靠近可采集的柱子时海鸟会鸣叫。
采集时概率掉落“白色羽毛”、“黑色羽毛”或“鸟蛋”。
	]],
	shanhai_ginkgoleave_ground = [[
【背景】
银杏叶制作的装饰，放置在地面，可用铲子铲除。
	]],

	deepseacave = [[
【背景】
镇压异兽的法器，由朱源、羽润看守，天体碎片掉落后，在塔顶砸出了一个破洞，这让塔内二层被封印的异兽蠢蠢欲动...

【获取】
在桦树林区域捕捉“纸燕”，通过谋杀或者“羽毛笔”逼供“纸燕”的方式获取“线索纸”。将“线索纸”交给被收买的猪哥进行翻译，概率获取正确的解密答案。前往“昆仑龙脉岛屿”，在“烛龙法阵”输入密码得到该道具。

【特殊】
世界唯一的物品，玩家放置后变为建筑，并获取“洞天封印”。可通过“洞天塔”进入世界之外的“洞天塔岛屿”，使用“洞天封印”可将其重新封印为物品。由于世界唯一，“洞天塔”无法被带入洞穴，想从洞穴世界中进入“洞天塔岛屿”，可以使用道具“云开”。
	]],
	deepseacave_seal = [[
【背景】
放置“洞天塔”后获取，同时也是封印“洞天塔”的道具。

【特殊】
可靠近科学机器制作（为防止玩家丢失封印），多余的封印可作为篝火的燃料。
	]],
	sh_desc = [[
【背景】
山河表里MOD的说明页。

【特殊】
可靠近科学机器制作（防止玩家丢失），多余的卷轴可作为篝火的燃料，可放入书架。
	]],
	sh_redpaper = [[
【背景】
“朱源”向猪人部落求助的线索媒介，杀死“纸燕”后掉落，使用“羽毛笔”逼供鸟笼中的“纸燕”掉落。可作为燃料，拥有耐久，耐久消失后变为灰烬。

【特殊】
收买一只猪哥后，给予“线索纸”可以进行破解，20%获取解密答案，拥有保底机制，5次破解必出正确答案。

尝试给未被收买的猪哥进行破解时，玩家会被猪哥嘴臭。

破解“线索纸”概率发现小彩蛋，彩蛋来自：作者昵称、神雕侠侣、无间道、武林外传、甄嬛传、闪灵、怪诞小镇、老友记。
	]],
	shanhai_goumang = [[
【背景】
《山海经·海外东经》：东方勾芒，鸟身人面，乘两龙。传说中的春神、木神、东方之神、东海之神、木星之神，掌管草木的生长。
默认难度配置下，采集“句芒植株”有7%的概率掉落，“羽润”的回礼也有小概率掉落。给予“鲲鹏”1个“句芒叶”可以获取“句芒印记”蓝图。

【特殊】
给予“昆仑龙脉岛屿”的“鲲鹏”有极小概率换取1个“坎普斯背包”。

字谜：天地灵韵聚凝华
	]],
	xuanhe_passport = [[
【背景】
“悬河秘境”的通行证，击杀“朱厌”掉落。
	]],
	sh_qystick = [[
【背景】
《山海经·西次三经》：昆仑山，有鸟焉，其状如蜂，大如鸳鸯，名曰钦原，蠚鸟兽则死，蠚木则枯。
被天体能量浸染的尾刺，在朱源的小铺进行交易掉落。

【特殊】
手持后右键施法，召唤友好生物“钦原”。
	]],
	sh_feather_phoenix = [[
【背景】
“凤凰虚影”掉落的尾羽。建造“百鸟朝凤雕塑”并使用各色羽毛进行装饰后，召唤“凤凰虚影”，追逐“凤凰虚影”必定掉落“彩色羽毛”。

【特殊】
给予“羽润”1根“彩色羽毛”后，“羽润”会为玩家解锁“洞天塔”一层的附属岛屿。
可与“猪王”进行交易，价值99金块，也可给予“蚁狮”延缓其发怒时间。

“彩色羽毛”不可以装饰雪人，官方目前没有接口开放，且相关代码耦合度有点高，期待大佬们的解决方案。
	]],
	sh_backpack_leaf = [[
【背景】
在“朱源的小铺”制作，14格背包空间，防雨防雷。

【特殊】
装备后，会有暗影仆从手持叶片遮挡在玩家头部。
	]],
	sh_zybell = [[
【背景】
“朱厌”的铃铛，击杀“朱厌”掉落。
	]],
	sh_panflute = [[
【背景】
在“朱源的小铺”制作，4次使用耐久。

【特殊】
需要装备在手上才能演奏，不能再骑行时使用（因为没有这个动画）。
吹奏消耗50血量、恢复50san值，并使范围内的玩家集体回SAN。
吹奏声音会强行唤醒附近昏睡的玩家，即使是在帐篷和睡袋中睡觉的玩家。
吹奏声音可以照料作物。

吹奏可以击杀影怪或者洞穴中听力发达的生物，可被击杀的对象如下
+ 影怪、梦魇影怪
+ 疯猪身上掉下的寄生暗影
+ 暗影穴居猴
+ 远古织影者的看不见的手
+ 蝙蝠、兔人、尘蛾、球状光虫、裸鼹蝠、啜食者、蛞蝓龟、石虾、蠕虫等听力发达的穴居生物
（不包括巨型蠕虫，以及听力不发达的蜘蛛）

远古排箫的吹奏动画文件来自MOD——山海密藏，感谢宗主！
	]],
	shanhai_starfly = [[
【背景】
借助星星的力量，吸引物体并进行区分。

【特殊】
右键施法后，吸引附近的物品升空，自动堆叠整理，相同物品不同皮肤也会区分，10s后物品降落。
可用于捡取掉落海边的物品、洞穴中的孤岛物品，或是整理地面道具。
	]],
	shanhai_moonfall = [[
【背景】
借助月亮的力量，驱逐一块陨石掉落到地面。

【特殊】
手持后右键施法，在指定位置落下1颗大陨石。可用于砍树、挖矿、生产“月岩”。

天狗食月事件期间，对“天狗食月雕塑”施法可打断“天狗食月”事件，此时天体能量会附身天狗，在雕塑附近掉落“附身座狼”。
	]],
	dsc_copytool = [[
【背景】
“朱源”法术加成的传送道具，用于快速回到“洞天塔”，洞穴内也可使用。

【特殊】
给予“朱源的小屋”1个“猪鼻铸币”后获取。
放置后生成1个可传送到“朱源的小屋”附近的卷轴虫洞。传送功能类似“旺达”的“溯源表”，可在洞穴中使用。传送功能有2分钟的CD，可重复使用。
	]],
	sh_migutwig = [[
【背景】
《山海经》：迷穀，木也，生於西海招搖山之上，其狀若構樹，有黑理焉，光華四照，人佩之而不迷。

【特殊】
采集“迷榖树”掉落，装备后自带叶片粒子特效。

将“迷榖枝”放在地面后，可右键操作进行引路：
在地面引路，会指向：“昆仑龙脉”、“月亮码头”
在洞穴引路，会指向：“远古科技”、“档案馆”


玩家手持“迷榖枝”，可以对指定对象进行聚灵、恶搞，以升级功能：
对“昆仑龙脉”的“烛龙法阵”、“月亮码头”的“非自然传送门”聚灵，可以升级移速加成；
移速加成：0% -> 15% -> 30%

玩家手持“迷榖枝”对任意的“远古科技站”、“华丽基座”、“羽润”（3级好感度）聚灵便可以发光，之后聚灵其它两个对象，可以扩大光源范围。
光源范围：小 -> 中 -> 大

玩家可对更高级的“迷榖枝”施法，复制对方的属性，俗称沾光。
	]],
	sh_magicshanshen = [[
【背景】
在月圆之夜，给予“羽润”1个“南瓜”换取蓝图制作。西方魔法，东方法术，鸦都会一点！

【特殊】
该道具属于小彩蛋，不是山河的内容，所以预计不会进行更多功能拓展。
	]],
	sh_killall_weapon = [[
【背景】
“朱厌”的角，击杀“朱厌”掉落。

【特殊】
默认配置下，攻击力与“铥矿棒”相同。使用“朱厌角”击杀生物后，秒杀范围20内的所有同名生物。
	]],
	sh_leafboat_item = [[
【背景】
在“朱源的小铺”制作。

【特殊】
放置在海洋变为小船，自带1格船灯位置；
非航行状态下右键可以将小船收回；
小船没有使用耐久，船体受到的伤害均由玩家承担；
可以携带重物登船，但会导致玩家减速。
	]],
	sh_boat_torch = [[
【特殊】
可放置在小叶槎的船灯位置，右键打开、关闭。
	]],
	shanhai_seed_gem = [[
【背景】
被“句芒印记”赋予草木神力的种子，可靠近炼金引擎制作。“羽润”回礼概率掉落。

【特殊】
投入“小石潭”，或者直接寄生到“水中木”可以生成“晶洞果藤”。
	]],
	shanhai_seed_night = [[
【背景】
被“句芒印记”赋予草木神力的种子，可靠近炼金引擎制作。“羽润”回礼概率掉落。

【特殊】
投入“小石潭”，或者直接寄生到“水中木”可以生成“夜莓果藤”。
	]],
	shanhai_seed_tallbirdegg = [[
【背景】
被“句芒印记”赋予草木神力的种子，可靠近炼金引擎制作。“羽润”回礼概率掉落。

【特殊】
投入“小石潭”，或者直接寄生到“水中木”可以生成“高脚鸟蛋藤”。
	]],
	shanhai_seed_shanshen = [[
【背景】
被“句芒印记”赋予草木神力的种子，可靠近炼金引擎制作。“羽润”回礼概率掉落。

【特殊】
可以直接栽种，生成“山参”。
	]],
	shpighat = [[
【背景】
用来伪装自己是猪人的面具。

【特殊】
佩戴后，佩戴者的鱼人族追随者会立即停止追随，佩戴者会被视作猪人族，并且不会被视作怪物。
佩戴者可以与猪王、猪人进行交易，不会被猪人主动仇恨。佩戴者会被鱼人主动仇恨。
	]],
	shanhai_goumang_item = [[
【背景】
采集“句芒植株”掉落，可用于制作科技道具。可生吃，可视为1单位蔬菜入锅。
	]],
	ganoderma_cap = [[
【背景】
采集“灵芝”后掉落，可生吃食用以恢复大量血量，可视为1单位蔬菜入锅。
	]],
	ganoderma_cap_cooked = [[
【背景】
烹烤“灵芝”后获取，食用以恢复大量三维。
	]],
	shanhai_shanshen = [[
【背景】
修炼成精的老山参，采集被“红绳”束缚的“山参植株”掉落。

【特殊】
可生吃，可入锅，功效暂同曼德拉草。
	]],
	shanhai_cookedshanshen = [[
【背景】
烹烤'山参'后获取，可入锅，功效暂同烤熟的曼德拉草。

可在“朱源的小铺”制作小叶笛。
	]],
	shanhai_ginkgo = [[
【背景】
银杏树的果实，砍伐金色银杏树掉落，可栽种为银杏植株。

【特殊】
可生吃，可视为1单位水果入锅。
	]],
	shanhai_ginkgoleave = [[
【背景】
砍伐金色银杏树掉落。

【特殊】
可制作装饰，放置在地面。后续会作为料理原料和用于制作科技道具。

字谜：金黄满树如蝶翻。
	]],
	dug_shanhai_goumang_plant = [[
【背景】可移植的'句芒植株'。

【特殊】栽种后只可使用'息壤'施肥。
	]],
	shanhai_xirang_item = [[
【背景】
《山海经·海内经》：洪水滔天，鲧窃帝之息壤以堙洪水，不侍帝命，帝令祝融杀鲧于羽郊。鲧腹生禹，帝乃命禹率布土以定九州。。
无消耗的肥料，催长剂、堆肥、粪肥的营养值都是999。

【特殊】
累计使用30次，或是对“棱镜”的子圭系列施肥后会进入长时间的冷却。
	]],
	shanhai_redrope = [[
【背景】
鲜血浸染的绳子，靠近科学机器制作。

【特殊】
可用于束缚“山参”，防止“山参”逃跑。也可用于召回“钦原”。
	]],
	shanhai_pinecone = [[
【背景】
被“句芒印记”赋予草木神力的种子，靠近科学机器制作。可栽种为“臃肿常青树”树苗，也可以放入冬季盛宴的花盆。
	]],
	saddle_kun_ground = [[
【背景】
“鲲鹏”背上的小云朵。
	]],
	sh_fireworks = [[
【背景】
过年期间的气氛小物件。

【特殊】
点燃后释放7到11个烟花，伴随烟花粒子和随机的朱源、羽润头像。
	]],
	sh_ironopenwork_base_kit = [[
【背景】
过年期间的气氛小物件。

【特殊】
激活后发射小烟花粒子，持续18秒，期间会进行3次判定，每次都有0.5%的概率判定成功，喷发3~5个奖励。
冬季盛宴期间，判定概率增长到1%。
奖励概率：金块>红宝石=蓝宝石=猪鼻铸币>橙宝石=黄宝石>绿宝石=紫宝石=空的长生不老药。
	]],
	shanhai_bubbletea = [[
【背景】
拥有草木神力的饮品。

【特殊】
“山海烧仙草”为冷料理，制作时会在锅底生成冷火。食用后5s内温度持续降低。
“山海烧仙草”是“羽润”最喜欢的食物，给予“羽润”必定获得回礼。
	]],
	sh_ganodermaice = [[
【背景】
拥有开智法术的饮品，食用后解锁所有科技1次。

【特殊】
给予“朱源”1个“芝上谈冰”，可以换取“朱源的小铺”蓝图。

纸上得来终觉浅，绝知此事要躬行。
	]],
	sh_neverold = [[
【背景】
西王母遗失在永恒大陆的“长生不老药”。食用后饥饿、血量上限增加30，精神上限不会变化。
重选人物后，三维增长会被继承。

这会是一场骗局吗，你并不会因为体力变强、胃口变好而变得更精神？
	]],
	sh_fsm_monkey_zhuyan = [[
【背景】
《山海经·西山经》：有兽焉，其壮如猿而白首赤足，名曰朱厌，见则大兵。

【特殊】
与“山海秘藏”的联动，开启“山海秘藏”后，“山河表里”的“朱厌”战斗时的召唤生物将会添加“小朱厌”。
	]],
	sh_abysspillar = [[
【背景】
与异域长老进行游戏，获胜后概率获取蓝图，可放置在海上通行。

【特殊】
小木桩的代码设计、贴图与拼好MOD共用。
别玩了，快点画！
	]],
	sh_taco = [[
【背景】
普通的杂粮煎饼，似乎没有什么特别的。
	]],
	sh_zhulong_taco = [[
【背景】
赋予时空之力的卷饼，永远吃不完！
将“山河卷饼”放到烛龙雕塑献祭，有0.1%的概率被转换为“时空卷饼”。

【特殊】
时空卷饼可以卷起料理，赋予时空之力。
时空卷饼永远不会腐烂，玩家咬下一口后自动补充完整，并提供原料理的食用效果。
	]],
}

return sh_desc_ch